import React, { Component } from 'react'
import { ScrollView, Text, ActivityIndicator, Platform, ImageBackground } from 'react-native'
import { connect } from 'react-redux'
import { responsiveHeight, responsiveWidth, responsiveFontSize } from 'react-native-responsive-dimensions';

// Add Actions - replace 'Your' with whatever your reducer is called :)
// import YourActions from '../Redux/YourRedux'

// Styles
import styles from './Styles/WhoAreWeScreenStyle'
import Api from '../Services/Api';
import moment from 'moment';
import { Metrics } from '../Themes';
import { View } from 'native-base';
import LoadingIndicator from '../Components/LoadingIndicator';
import QkHeader from '../Components/QkHeader';
const QKLogoBW = require('../Images/QKLogoBW.png')

const whoAreWeText1 = `
بسم الله الرحمن الرحيم
إِنَّ هَـذَا الْقُرْآنَ يِهْدِي لِلَّتِي هِيَ أَقْوَمُ وَيُبَشِّرُ الْمُؤْمِنِينَ الَّذِينَ يَعْمَلُونَ الصَّالِحَاتِ أَنَّ لَهُمْ أَجْراً كَبِيراً
تعريف بإذاعة القرآن الكريم من نابلس فلسطين

الإذاعة في سطور:
تأسست إذاعة القرآن الكريم في مدينة نابلس شمال فلسطين عام 1419هـ الموافق للعام الميلادي 1998، وهي مؤسسة إعلامية حيادية مستقلة تعنى بالقرآن الكريم وعلومه، وشركة مسجلة تحمل الاسم الرسمي: (الصفا لإذاعة القرآن الكريم وعلومه العادية العامة).

الفكرة والانطلاق:
في وقت انتشرت فيه العديد من وسائل الإعلام المختلفة؛ بزغت فكرة إنشاء إذاعةٍ تصدع بصوت القرآن الكريم لتقدم بديلاً طيباً من معينٍ عذبٍ زلالٍ طهور، تنير حلكة ليل تعطشت فيها النفوس المؤمنة إلى النور.
وتجسدت الفكرة بذرة طيبة نمت في قلوب القائمين عليها، لتشمخ شجرة طيبة باسقة، تؤتي ثمارها كل حين بإذن ربها في قلوب المستمعين .... فتحولت الفكرة التي جالت في خاطر فضيلة الشيخ محمد سعيد ملحس - رحمه الله - إلى واقع تمثل في البدء بتأسيس هذه الإذاعة، ومعه أبناؤه ليكونوا له عوناً في هذا الشرف العظيم.
ففي الثاني عشر من ربيع الآخر .. عام 1419 الموافق للعام الميلادي 1998 .. انطلق صوت إذاعة القرآن الكريم من قلب مدينة المآذن .. مدينة الخير والبركة والمحبة .. مدينة نابلس عش العلماء.. في الوقت الذي كان الناس بأمس الحاجة إلى روحانيات تشتاق إليها النفس كلما ضاقت الدنيا بها .

الإدارة:
1.  المحامي رضا "محمد سعيد" ملحس: رئيس مجلس الإدارة، ومديرها العام، منذ عام 2017، وذلك بعد وفاة والده  فضيلةُ الشيخ "محمد سعيد" ملحس رحمه الله: مؤسس الإذاعة، ومالكها، ورئيس مجلس إدارتها السابق، وهو شيخ قراء شمال فلسطين، وصاحب كتاب أحكام تجويد القرآن على رواية حفص بن سليمان والذي تم تدريسه لفترات طويلة في جامعات فلسطين ولا زال يُدرَّس في دور القرآن الكريم التابعة لوزارة الأوقاف الفلسطينية، وغيرها من الجامعات العربية،.
2.     الأستاذ أسامة "محمد سعيد" ملحس: رئيس التحرير، عضو مجلس الإدارة، الإعلامي المعروف، معد ومقدم ومخرج كثير من برامجها .
3.     الشيخ "محمد نور" "محمد سعيد" ملحس: مدير شئون الموظفين، عضو مجلس الإدارة، متخصص في الشريعة الإسلامية، ومتابع الضوابط الشرعية المتعلقة بمنهج الإذاعة.
4.     الشيخ بشار أبو زهرة: مدير قسم البرامج، عضو استشاري في مجلس الإدارة، ماجستير فقه وتشريع، مقدم كثير من البرامج الدينية والذي كان على رأسها أول البرامج ((أنت تسأل والمفتي يجيب)) .
5.     المهندس جعفر الخياط: مدير التسويق، عضو استشاري في مجلس الإدارة.`
const whoAreWeText2 = `
العاملون:
مجموعة من الموظفين المتخصصين كل في مجاله، وحسب المهام الموكلة إليه من شرعيين وتقنيين وفنيين، لهم أجرهم وأجورهم، عكفوا على خدمة الإذاعة وتسيير أمورها، مبتغين جميعاً رضى الله عز وجل، مستشعرين قدسية الرسالة، وعظم المسؤولية في الدعوة إلى الله.

نشأة الإذاعة وتطورها:
نشأت الإذاعة بإمكانيات بسيطة تقنياً وفنياً، وبتغطية جغرافية ضيقة بثاً وإرسالاً، ثم ما لبثت والحمد لله أن تطورت فنياً بحواسيبها ومعداتها، واتسعت جغرافياً بمساحة بثها، ونمت بأجهزتها وأبراج تقويتها التي وُضِعَت في مناطق مختلفة من مدن الضفة الغربية، حيث أصبح أثير إذاعة القرآن الكريم يغطي فعلياً 90 % من أراضي فلسطين، إضافة إلى مناطق عديدة من الأردن، وأجزاء من مصر، وبذلك يكون بث الإذاعة من أوسع المحطات المحلية من حيث التغطية الجغرافية.
كما عملت الإذاعة ضمن خطتها التطويرية على إيصال بثها للعالم عبر شبكة الإنترنت من خال موقعنا وصفحتنا على الفيس بوك، WWW.QURAN-RADIO.COMوتطبيقات خاصة على كل من (الآندرويد و الآي فون) إضافة إلى اليوتيوب، ليتسنى وصول صوت الإذاعة إلى أكبر عدد ممكن من المستمعين، وقد واكب هذا التطور والتوسع زيادة في عدد الموظفين ومن ثم الانتقال من مقرها القديم المتواضع إلى مقر جديد واسع يليق بالقرآن وأهله بإذن الله .
واستمرت مسيرة التطور والتطوير في شتى المجالات بشكل حثيث مكثف، وبخط بياني تصاعدي ولله الحمد والمنّة، وما زالت الإذاعة تعمل على تطوير كادرها الإداري والفني والمهني للارتقاء بهذا الصرح الإعلامي، والوصول به إلى ما يحقق الأهداف ويرضي ربنا تبارك وتعالى .

الهدف والرسالة:
العمل لهدفٍ واحد لا تحيد الإذاعة عنه مهما طال الأمد ومهما تغيّرت الظروف .. هدفها القائمِ على الدعوة " إِلَىٰ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ" وربط الناس بكتاب الله عز وجل، من خلال سماع قرآنه، وفهم آياته، وتعلُّم أحكامه. والدعوة إلى العمل بمقتضاه في مناحي الحياة. " وَالَّذِينَ يُمَسِّكُونَ بِالْكِتَابِ وَأَقَامُوا الصَّلَاةَ إِنَّا لَا نُضِيعُ أَجْرَ الْمُصْلِحِينَ" وذلك للوصول إلى الهدف الأسمى للقائمين على الإذاعة بأن يرضى الله عنهم، (رَّضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ۚ ذَٰلِكَ لِمَنْ خَشِيَ رَبَّهُ (ُ البينة - الآية 8

منهجها:
إذاعة القرآن الكريم حيادية مستقلة، ومتخصصة بالقرآن الكريم وعلومه ومعارفه، رائدها الإيمان العميق بترسيخ العقيدة الإسلامية، شراعها العلم الصحيح المنبثق من الكتاب والسنة، نبراسها توحيد المسلمين على هذا الدين العظيم الموحدِ للمسلمين، ودعوتهم إلى الاعتصام بكتاب الله، وتجنب الخلافات المذهبية والحزبية. "وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا"ْ .

مصادر دخلها:
ولقد يسّر الله تعالى لتغطية نفقاتها عدة مشاريع تغطي كلفتها التشغيلية والتطويرية، ومن هذه المشاريع:
· الدعايات التجارية ورعاية البرامج .
· مشروع "رسائل الإيمان": وهي خدمة من خدمات الرسائل القصيرة smsتقدمها الإذاعة لمشتركي شركتي جوال و اوريدو في فلسطين، ما بين حكمة بليغة .. وموعظة مؤثرة .. ودعاء من الكتاب والسنة والسلف الصالح، وتذكير بالأحداث التاريخية الإسلامية، وبالمناسبات الدينية كالعيدين ورمضان وما يتعلق بها من توجيهات وأحكام، وتذكير بمواعيد برامج الإذاعة. وقد بلغت ما يقارب الستة آلاف رسالة. ثم بفضل الله تم تسجيل هذه الرسائل بالصوت، ويتم بثها حاليا عبر أثير الإذاعة، لتعم الفائدة على المشتركين والمستمعين، ولتصبح رسائل مقروءة ومسموعة بإذن الله رب العالمن .
· مبيعاتها من إصدارات صوتية ومطبوعة ، والروزنامة الهجرية السنوية، وإصدارات صوتية عديدة.
· فضلا عن أن هذه الإذاعة كان قد نذرها صاحبها لله جل في علاه، وهي بعد وفاته لا تزال كذلك، فهي لا يُتَقاضى منها أية أرباح؛ فكل دخلها يُرصد للتطوير الدائم والطموح اللا متناهي.
`
const whoAreWeText3 = `
برامجها:
تحرص (لجنة البرامج) في الإذاعة على دورية اجتماعاتها لوضع الخطط البرنامجية ودراسة حاجة المستمعين إلى موضوعات معينة ضمن دراسة الأحوال السائدة مجتمعياً أو أخلاقياً أو اقتصادياً، أو ما تستدعيه المناسبات الموسمية؛ كشهر رمضان وشهر الإسراء والمعراج، وشهر ربيع الأول بسيرة المصطفى صلى الله عليه وسلم، وموسم الحج، أو موسم المدارس والجامعات ...، وكذلك متابعة اقتراحات المستمعين بتقييم ما كان من برامج، أو ما يحتاجونه منها، خال الموجة المفتوحة السنوية في ذكرى تأسيس الإذاعة، ولذلك أكدت الإذاعة دائما على أن المستمعين (شركاء في العطاء) وفي المساهمة في رسم مسارها وسيرتها في برامجها.
ومن برامجها:
1.     القرآن الكريم: البرنامج الأطول والأكثر مساحة، إذ هو الواجهة الرئيسية لكل برامجنا، بأجمل أصوات المقرئين المشاهير؛ في ختمٍ متواصل ومرتّبٍ للقرآن الكريم، مضافا إليهم قارئين فلسطينيين (محليين) ضمن مشروع يهدف إلى تسجيلٍ متقنٍ بأصواتِ قرّاء من بيت المقدس وأكنافه .
2.     علوم القرآن وتفسيره : في برامج متنوعة؛ لبيان الأحكام الشرعية في الآيات تارة، أو لنثر كنوز اللغة والبلاغة فيه تارة أخرى، أو العمل على دروس تدريبية عملية لتعليم أحكام التلاوة للمستمعين على الهواء...
3.     مختارات من الأحاديث النبوية، والأدعية والابتهالات، والمداخات المجتمعية.
4.     مختارات عذبة من رياض النشيد الهادف.
5.     ندوات علمية، ودروس إيمانية، ورقائق قلبية، ومنها البرنامج اليومي الأشهَر (الكلمة الطيبة) .
6.     برامج السيرة النبوية، وسير الصحابة والتابعين ومن تبعهم بإحسان إلى يوم الدين.
7.     برامج فقهية تتسم بالوسَطية، والبُعد عن الخوض في القضايا الخلافية، من خال دروس مسجلة لمختصين، أو باستضافة أهل العلم في حلقات مباشرة مع جمهور السائلين من المستمعين، مثل برنامج (أنت تسأل والمفتي يجيب) .
8.     برامج حوارية وتفاعلية منوعة؛ اجتماعية، وثقافية، وتربوية. وفي التنمية البشرية، وقضايا الأسرى وأرض المسرى والمسجد الأقصى .
9.     برامج ترفيهية متزنة، ومسابقات ثقافية، ومسابقات أجمل الأصوات في التلاوة .
10.مسلسلات وتمثيليات درامية للكبار والأطفال، في القضايا المجتمعية والتربوية والعلاقات الأسرية وحتى الفقهية، وكذلك في السيرة وسير الصحابة والتابعين، وغيرهم من ذوي البصمة في الحضارة الإسلامية .
11.الحملات الدورية المكثفة في موضوعات حيوية تهدف إلى التأثير حتى التغيير، مثل حملة مكافحة التدخين، حملة «حجابي جنتي»، حملة بِرُّ الوالدين، حملة «صلاة الفجر طريق النصر»، حملة «مالكم لا ترجون لله وقارا»، حملة «يمحق الله الربا»، حملة «في القلب أنتم» لمساندة الأسرى في سجون الاحتلال، حملة خاصة بالقدس الشريف لتعزيز الانتماء إلى أرض الإسراء .
ولقد استضافت الإذاعة عبر أثيرها الكثير من كبار العلماء والدعاة والمقرئين والمنشدين في لقاءات خاصة، فقربتهم من محبيهم المستمعين، وارتبط الكثير من هؤلاء بعلاقات طيبة مثمرة ومستمرة مع الإذاعة، بشواهدِ الاستمرار في تزويدها بتسجيلاتهم وإصداراتهم، بل ومن ذلك ما كان فيه السبق على الإذاعات الأخرى بالبث الحصري لهذه الإذاعة المباركة مما تخيروه لها .

رؤيتها :
فإننا نَسعد بما أنجزناهُ لوجهه الكريم سبحانه وخدمةِ كتابه العظيم جل في علاه، وإيصال أثير القرآن إلى كل مكان في فلسطين الحبيبة وما حولها، حتى أصبحْتَ تسمع القرآن يصدح على مدار الساعة في كل بيت ومحل وشارع وسيارة فأضحى مئات الألوف من الناس لا يستغنون عنها.
وما زال الطموح إلى المزيد من الارتقاء يشغل بال كل فرد من أفراد أسرة الإذاعة ومحبيها، ويعمل كل واحد منهم على أن يُؤتى الارتقاء من قِبَله ليرتقي بالثواب عند الله تبارك وتعالى .

إذاعة القرآن الكريم من نابلس
 الصّوت القريب من القلوب`

class WhoAreWeScreen extends Component {

  render() {
    return (
      <ImageBackground
        style={{
          flex: 1,
          position: 'absolute',
          width: Metrics.screenWidth,
          height: Metrics.screenHeight,
          alignSelf: 'center'
        }}
        resizeMode='stretch'
        source={this.props.image}
      > 
        <QkHeader bg={QKLogoBW} title={"من نحن"} />
        <ImageBackground
          style={{
            alignSelf: 'center',
            position: 'absolute',
            top: Metrics.screenHeight / 3,
            width: Metrics.screenWidth / 2,
            height: Metrics.screenHeight / 2
          }}
          resizeMode="contain">
          <View style={{ flex: 3, alignSelf: 'center' }}>
            <ScrollView style={{ width: Metrics.screenWidth - 70, position: 'absolute', alignSelf: 'center', height: Metrics.screenHeight / 3 * 2 - 80 }}>
              <Text style={{ fontFamily: Platform.OS == 'ios'? null: 'Al-Jazeera-Arabic-Regular', color: 'black', textAlign: 'center', fontSize: this.props.fontSizeFactor * responsiveFontSize(2.5), padding: 20 }}>
                {whoAreWeText1}
              </Text>
              <Text style={{ fontFamily: Platform.OS == 'ios'? null: 'Al-Jazeera-Arabic-Regular', color: 'black', textAlign: 'center', fontSize: this.props.fontSizeFactor * responsiveFontSize(2.5), padding: 20 }}>
                {whoAreWeText2}
              </Text>
              <Text style={{ fontFamily: Platform.OS == 'ios'? null: 'Al-Jazeera-Arabic-Regular', color: 'black', textAlign: 'center', fontSize: this.props.fontSizeFactor * responsiveFontSize(2.5), padding: 20 }}>
                {whoAreWeText3}
              </Text>
            </ScrollView>
          </View>
        </ImageBackground>
      </ImageBackground>
    )
  }
}

const mapStateToProps = (state) => {
  return {
    fontSizeFactor: state.startup.fontSizeFactor
  }
}

const mapDispatchToProps = (dispatch) => {
  return {
  }
}

export default connect(mapStateToProps, mapDispatchToProps)(WhoAreWeScreen)
